STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_c_initphyconfig.c
/**
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include <stdlib.h>

#include "stm32mp2xx_hal.h"
#include "stm32mp2xx_hal_ddr_ddrphy_phyinit.h"
#include "stm32mp2xx_hal_ddr_ddrphy_wrapper.h"

/*
 * Program txslewrate:
 * - txslewrate::txpredrvmode is dependent on dramtype.
 * - txslewrate::txprep and txslewrate::txpren are technology-specific.
 *   User should consult the "Output Slew Rate" section of HSpice Model App Note in specific
 *   technology for recommended settings.
 */
static void txslewrate_program(void)
{
  int32_t pstate;
  int32_t txpredrvmode;

#if STM32MP_DDR3_TYPE
  txpredrvmode = 0x3;
#elif STM32MP_DDR4_TYPE
  txpredrvmode = 0x2;
#elif STM32MP_LPDDR4_TYPE
  txpredrvmode = 0x1;
#endif /* STM32MP_LPDDR4_TYPE */

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t byte;
    int32_t p_addr;
    int32_t txpren; /* Default to 0xf (max). Optimal setting is technology specific. */
    int32_t txprep; /* Default to 0xf (max). Optimal setting is technology specific. */
    uint16_t txslewrate;

    p_addr = pstate << 20;

    txprep = userinputadvanced.txslewrisedq[pstate];
    txpren = userinputadvanced.txslewfalldq[pstate];

    txslewrate = (uint16_t)((txpredrvmode << CSR_TXPREDRVMODE_LSB) |
                            (txpren << CSR_TXPREN_LSB) |
                            (txprep << CSR_TXPREP_LSB));

    for (byte = 0; byte < userinputbasic.numdbyte; byte++)
    {
      int32_t c_addr;
      int32_t lane;

      c_addr = byte << 12;
      for (lane = 0; lane <= B_MAX; lane++)
      {
        int32_t b_addr;

        b_addr = lane << 8;
        mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TDBYTE |
                                  c_addr | b_addr | CSR_TXSLEWRATE_ADDR)),
                      txslewrate);
      }
    }
  }
}

/*
 * Program atxslewrate:
 * - atxslewrate::atxpredrvmode is dependent on dramtype and whether
 *   the ACX4 instance is used for AC or CK
 * - atxslewrate::atxprep and atxslewrate::atxpren are technology-specific
 *   User should consult the "Output Slew Rate" section of
 *   HSpice Model App Note in specific technology for recommended settings
 */
static void atxslewrate_program(void)
{
  int32_t anib;
  int32_t atxpren; /* Default to 0xf (max). Optimal setting is technology specific. */
  int32_t atxprep; /* Default to 0xf (max). Optimal setting is technology specific. */
  int32_t ck_anib_inst[2] = { 0 };

  atxprep = userinputadvanced.txslewriseac;
  atxpren = userinputadvanced.txslewfallac;

  /*
   * # of ANIBs      CK ANIB Instance
   * ACX8            ANIB 1
   */
  if (userinputbasic.numanib == 8)
  {
    ck_anib_inst[0] = 1;
    ck_anib_inst[1] = 1;
  }

  for (anib = 0; anib < userinputbasic.numanib; anib++)
  {
    int32_t atxpredrvmode;
    int32_t c_addr;
    uint16_t atxslewrate;

    c_addr = anib << 12;

    if ((anib == ck_anib_inst[0]) || (anib == ck_anib_inst[1]))
    {
      /* CK ANIB instance */
#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
      atxpredrvmode = 0x0;
#elif STM32MP_LPDDR4_TYPE
      atxpredrvmode = 0x1;
#endif /* STM32MP_LPDDR4_TYPE */
    }
    else
    {
      /* non-CK ANIB instance */
#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
      atxpredrvmode = 0x3;
#elif STM32MP_LPDDR4_TYPE
      atxpredrvmode = 0x1;
#endif /* STM32MP_LPDDR4_TYPE */
    }

    atxslewrate = (uint16_t)((atxpredrvmode << CSR_ATXPREDRVMODE_LSB) |
                             (atxpren << CSR_ATXPREN_LSB) |
                             (atxprep << CSR_ATXPREP_LSB));

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TANIB | c_addr | CSR_ATXSLEWRATE_ADDR)),
                  atxslewrate);
  }
}

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
/*
 * Program dfirddatacsdestmap and dfiwrdatacsdestmap
 * - Dependencies: mb_ddr_1d[0].msgmisc[6] Determine Partial Rank Support
 */
static void dfidatacsdestmap_program(void)
{

  if ((mb_ddr_1d[0].msgmisc & 0x40U) != 0U)
  {
    int32_t pstate;
    uint16_t dfirddatacsdestmap = 0xA0U;
    uint16_t dfiwrdatacsdestmap = 0xA0U;

    for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
    {
      int32_t p_addr;

      p_addr = pstate << 20;

      mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER |
                                CSR_DFIRDDATACSDESTMAP_ADDR)),
              dfirddatacsdestmap);
      mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER |
                                CSR_DFIWRDATACSDESTMAP_ADDR)),
              dfiwrdatacsdestmap);
    }
  }
}
#endif /* STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE */

/*
 * Program pllctrl2:
 * - Calculate PLL controls per p-state from frequency
 */
static void pllctrl2_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t p_addr;
    uint16_t pllctrl2;

    p_addr = pstate << 20;

    if ((userinputbasic.frequency[pstate] / 2) < 235)
    {
      pllctrl2 = 0x7U;
    }
    else if ((userinputbasic.frequency[pstate] / 2) < 313)
    {
      pllctrl2 = 0x6U;
    }
    else if ((userinputbasic.frequency[pstate] / 2) < 469)
    {
      pllctrl2 = 0xBU;
    }
    else if ((userinputbasic.frequency[pstate] / 2) < 625)
    {
      pllctrl2 = 0xAU;
    }
    else if ((userinputbasic.frequency[pstate] / 2) < 938)
    {
      pllctrl2 = 0x19U;
    }
    else if ((userinputbasic.frequency[pstate] / 2) < 1067)
    {
      pllctrl2 = 0x18U;
    }
    else
    {
      pllctrl2 = 0x19U;
    }

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_PLLCTRL2_ADDR)),
                  pllctrl2);
  }
}

/*
 * Program ardptrinitval:
 * - The values programmed here assume ideal properties of DfiClk and Pclk including:
 *   - DfiClk skew
 *   - DfiClk jitter
 *   - DfiClk PVT variations
 *   - Pclk skew
 *   - Pclk jitter
 *
 * ardptrinitval Programmed differently based on PLL Bypass mode and frequency:
 * - PLL Bypassed mode:
 *   - For MemClk frequency > 933MHz, the valid range of ardptrinitval_p0[3:0] is: 2-5
 *   - For MemClk frequency < 933MHz, the valid range of ardptrinitval_p0[3:0] is: 1-5
 * - PLL Enabled mode:
 *   - For MemClk frequency > 933MHz, the valid range of ardptrinitval_p0[3:0] is: 1-5
 *   - For MemClk frequency < 933MHz, the valid range of ardptrinitval_p0[3:0] is: 0-5
 */
static void ardptrinitval_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t p_addr;

    p_addr = pstate << 20;

    if (userinputbasic.frequency[pstate] >= 933)
    {
      ardptrinitval[pstate] = 0x2;
    }
    else
    {
      ardptrinitval[pstate] = 0x1;
    }

    /* Add one UI for synchronizer on SyncBus when PLL is bypassed */
    if (userinputbasic.pllbypass[pstate] == 1)
    {
      ardptrinitval[pstate]++;
    }

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_ARDPTRINITVAL_ADDR)),
                  (uint16_t)ardptrinitval[pstate]);
  }
}

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
/*
 * Program ProcOdtCtl:
 * - Sets procodtalwayson/procodtalwaysoff for LPDDR4 for 4 different pstates using the PIE
 *   register seq0bgpr4.
 */
static void procodtctl_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t p_addr;
    int32_t procodtalwayson;
    int32_t procodtalwaysoff;
    uint16_t seq0bgpr4;

    p_addr = pstate << 20;

    procodtalwaysoff = 0;
    procodtalwayson = 0;

    seq0bgpr4 = (uint16_t)(0x00000000U |
                           (procodtalwayson << CSR_PROCODTALWAYSON_LSB) |
                           (procodtalwaysoff << CSR_PROCODTALWAYSOFF_LSB));
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TINITENG | C0 |
                              CSR_SEQ0BGPR4_ADDR)),
                  seq0bgpr4);
  }
}
#endif /* STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE */

