STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_c_initphyconfig.c
/*
 * Program dbytedllmodecntrl:
 * - dllrxpreamblemode
 * Program dqspreamblecontrol:
 * - Fields:
 *   - twotckrxdqspre
 *   - twotcktxdqspre
 *   - positiondfeinit
 *   - lp4tgltwotcktxdqspre
 *   - lp4postambleext
 *   - lp4sttcprebridgerxen
 * - Dependencies:
 *   - user_input_basic.dramtype
 *   - user_input_advanced.lp4rxpreamblemode (LPDDR4)
 *   - user_input_advanced.wdqsext (LPDDR4)
 *   - user_input_advanced.d4txpreamblelength (DDR4)
 */
static void dbytedllmodecntrl_program(int32_t *twotckrxdqspre)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t disdllgainivseed = 1;
    int32_t disdllseedsel = 0;
    int32_t dllgainiv = 0x1;
    int32_t dllgaintv = 0x6;
    int32_t dllrxpreamblemode = 0;
    int32_t lcdlseed0 = 0x21;
    int32_t lp4postambleext = 0;
    int32_t lp4sttcprebridgerxen = 0;
    int32_t lp4tgltwotcktxdqspre = 0;
    int32_t p_addr;
    int32_t positiondfeinit;
    int32_t twotcktxdqspre = 0;
    int32_t wdqsextension = 0;
    uint16_t dbytedllmodecntrl;
    uint16_t dllgainctl;
    uint16_t dlllockparam;
    uint16_t dqspreamblecontrol;

    p_addr = pstate << 20;

#if STM32MP_DDR3_TYPE
    /* Same as default */
    twotckrxdqspre[pstate]  = 0x0;
    lp4sttcprebridgerxen    = 0x0;
    dllrxpreamblemode       = 0x0;
    twotcktxdqspre          = 0x0;
    lp4tgltwotcktxdqspre    = 0x0;
    positiondfeinit         = 0x0;
    lp4postambleext         = 0x0;
#elif STM32MP_DDR4_TYPE
    twotckrxdqspre[pstate]  = userinputadvanced.d4rxpreamblelength[pstate];
    lp4sttcprebridgerxen    = 0x0;
    dllrxpreamblemode       = 0x1;
    twotcktxdqspre          = userinputadvanced.d4txpreamblelength[pstate];
    lp4tgltwotcktxdqspre    = 0x0;
    positiondfeinit         = 0x2;
    lp4postambleext         = 0x0;
#elif STM32MP_LPDDR4_TYPE
    /* Set to 1 if static Rx preamble */
    twotckrxdqspre[pstate] = (userinputadvanced.lp4rxpreamblemode[pstate] == 0) ? 1 : 0;
    /* Set to 1 if static Rx preamble */
    lp4sttcprebridgerxen = (userinputadvanced.lp4rxpreamblemode[pstate] == 0) ? 1 : 0;
    dllrxpreamblemode = 0x1;
    /* Must be 2*Tck Tx preamble according to JEDEC (mr1.OP[2] = 1) */
    twotcktxdqspre = 0x1;
    /* Must be toggling Tx preamble */
    lp4tgltwotcktxdqspre = 0x1;
    positiondfeinit = 0x0;
    lp4postambleext = userinputadvanced.lp4postambleext[pstate];
    wdqsextension = userinputadvanced.wdqsext;
#endif /* STM32MP_LPDDR4_TYPE */

    dqspreamblecontrol = (uint16_t)((wdqsextension << CSR_WDQSEXTENSION_LSB) |
                                    (lp4sttcprebridgerxen << CSR_LP4STTCPREBRIDGERXEN_LSB) |
                                    (lp4postambleext << CSR_LP4POSTAMBLEEXT_LSB) |
                                    (lp4tgltwotcktxdqspre << CSR_LP4TGLTWOTCKTXDQSPRE_LSB) |
                                    (positiondfeinit << CSR_POSITIONDFEINIT_LSB) |
                                    (twotcktxdqspre << CSR_TWOTCKTXDQSPRE_LSB) |
                                    (twotckrxdqspre[pstate] << CSR_TWOTCKRXDQSPRE_LSB));

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_DQSPREAMBLECONTROL_ADDR)),
                  dqspreamblecontrol);

    dbytedllmodecntrl = (uint16_t)(dllrxpreamblemode << CSR_DLLRXPREAMBLEMODE_LSB);
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TMASTER | CSR_DBYTEDLLMODECNTRL_ADDR)),
                  dbytedllmodecntrl);

    dllgainctl = (uint16_t)(dllgainiv | (dllgaintv << CSR_DLLGAINTV_LSB));
    dlllockparam = (uint16_t)(disdllseedsel | (disdllgainivseed << CSR_DISDLLGAINIVSEED_LSB) |
                              (lcdlseed0 << CSR_LCDLSEED0_LSB));

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_DLLLOCKPARAM_ADDR)),
                  dlllockparam);

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_DLLGAINCTL_ADDR)),
                  dllgainctl);
  }
}

/*
 * Program procodttimectl:
 * - Fields:
 *   - POdtStartDelay[3:2]
 *   - POdtTailWidth[1:0]
 * - Dependencies:
 *   - user_input_basic.frequency
 *   - user_input_basic.dramtype
 */
static void procodttimectl_program(int32_t *twotckrxdqspre)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t p_addr;
    uint16_t procodttimectl;

    p_addr = pstate << 20;

    if (userinputadvanced.wdqsext != 0)
    {
      /* POdtStartDelay = 0x0 and  POdtTailWidth  = 0x3 */
      procodttimectl = 0x3U;
    }
    else if (userinputbasic.frequency[pstate] <= 933)
    {
      /* Memclk Freq <= 933MHz: POdtStartDelay = 0x2 and POdtTailWidth  = 0x2 */
      procodttimectl = 0xAU;
    }
    else if (userinputbasic.frequency[pstate] <= 1200)
    {
      /* 933MHz < Memclk Freq <= 1200MHz */
      if (twotckrxdqspre[pstate] == 1)
      {
        /* POdtStartDelay = 0x0 and  POdtTailWidth  = 0x2 */
        procodttimectl = 0x2U;
      }
      else
      {
        /* POdtStartDelay = 0x1 and POdtTailWidth  = 0x2 */
        procodttimectl = 0x6U;
      }
    }
    else
    {
      /* Memclk Freq > 1200MHz */
      if (twotckrxdqspre[pstate] == 1)
      {
        /* POdtStartDelay = 0x0 and POdtTailWidth  = 0x3 */
        procodttimectl = 0x3U;
      }
      else
      {
        /* POdtStartDelay = 0x1 and POdtTailWidth  = 0x3 */
        procodttimectl = 0x7U;
      }
    }

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_PROCODTTIMECTL_ADDR)),
                  procodttimectl);
  }
}

/*
 * Program txodtdrvstren:
 * - Fields:
 *   - ODTStrenP_px[5:0]
 *   - ODTStrenN_px[11:6]
 * - Dependencies:
 *   - user_input_basic.dramtype
 *   - user_input_advanced.odtimpedance
 * \return 0 on success.
 */
static int32_t txodtdrvstren_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t byte;
    int32_t odtstrenn_state;
    int32_t odtstrenp_state;
    int32_t p_addr;
    uint16_t txodtdrvstren;

    p_addr = pstate << 20;

    odtstrenp_state = ddrphy_phyinit_mapdrvstren((int)userinputadvanced.odtimpedance[pstate],
                                                 ODTSTRENP);
    if (odtstrenp_state < 0)
    {
      return odtstrenp_state;
    }

    odtstrenn_state = ddrphy_phyinit_mapdrvstren((int)userinputadvanced.odtimpedance[pstate],
                                                 ODTSTRENN);
    if (odtstrenn_state < 0)
    {
      return odtstrenn_state;
    }

