STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_c_initphyconfig.c
    txodtdrvstren = (uint16_t)((odtstrenn_state << CSR_ODTSTRENN_LSB) | odtstrenp_state);

    for (byte = 0; byte < userinputbasic.numdbyte; byte++)
    {
      int32_t c_addr;
      int32_t lane;

      c_addr = byte << 12;
      for (lane = 0; lane <= B_MAX; lane++)
      {
        int32_t b_addr;

        b_addr = lane << 8;
        mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TDBYTE | c_addr | b_addr |
                                                      CSR_TXODTDRVSTREN_ADDR)),
                      txodtdrvstren);
      }
    }
  }

  return 0;
}

/*
 * Program tximpedancectrl1:
 * - Fields:
 *   - DrvStrenFSDqP[5:0]
 *   - DrvStrenFSDqN[11:6]
 * - Dependencies:
 *   - user_input_basic.dramtype
 *   - user_input_advanced.tximpedance
 * \return 0 on success.
 */
static int32_t tximpedancectrl1_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t byte;
    int32_t drvstrenfsdqn_state;
    int32_t drvstrenfsdqp_state;
    int32_t p_addr;
    uint16_t tximpedancectrl1;

    p_addr = pstate << 20;

    drvstrenfsdqp_state = ddrphy_phyinit_mapdrvstren((int)userinputadvanced.tximpedance[pstate],
                                                     DRVSTRENFSDQP);
    if (drvstrenfsdqp_state < 0)
    {
      return drvstrenfsdqp_state;
    }

    drvstrenfsdqn_state = ddrphy_phyinit_mapdrvstren((int)userinputadvanced.tximpedance[pstate],
                                                     DRVSTRENFSDQN);
    if (drvstrenfsdqn_state < 0)
    {
      return drvstrenfsdqn_state;
    }

    tximpedancectrl1 = (uint16_t)((drvstrenfsdqn_state << CSR_DRVSTRENFSDQN_LSB) |
                                  (drvstrenfsdqp_state << CSR_DRVSTRENFSDQP_LSB));

    for (byte = 0; byte < userinputbasic.numdbyte; byte++)
    {
      int32_t c_addr;
      int32_t lane;

      c_addr = byte << 12;
      for (lane = 0; lane <= B_MAX; lane++)
      {
        int32_t b_addr;

        b_addr = lane << 8;
        mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TDBYTE | c_addr | b_addr |
                                                      CSR_TXIMPEDANCECTRL1_ADDR)),
                      tximpedancectrl1);
      }
    }
  }

  return 0;
}

/*
 * Program atximpedance:
 * - Fields:
 *   - ADrvStrenP[4:0]
 *   - ADrvStrenN[9:5]
 * - Dependencies:
 *   - user_input_basic.dramtype
 *   - user_input_advanced.atximpedance
 * \return 0 on success.
 */
static int32_t atximpedance_program(void)
{
  int32_t adrvstrenn_state;
  int32_t adrvstrenp_state;
  int32_t anib;
  uint16_t atximpedance;

  adrvstrenp_state = ddrphy_phyinit_mapdrvstren((int)userinputadvanced.atximpedance,
                                                ADRVSTRENP);
  if (adrvstrenp_state < 0)
  {
    return adrvstrenp_state;
  }

  adrvstrenn_state = ddrphy_phyinit_mapdrvstren((int)userinputadvanced.atximpedance,
                                                ADRVSTRENN);
  if (adrvstrenn_state < 0)
  {
    return adrvstrenn_state;
  }

  atximpedance = (uint16_t)((adrvstrenn_state << CSR_ADRVSTRENN_LSB) |
                            (adrvstrenp_state << CSR_ADRVSTRENP_LSB));

  for (anib = 0; anib < userinputbasic.numanib; anib++)
  {
    int32_t c_addr;

    c_addr = anib << 12;
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TANIB | c_addr | CSR_ATXIMPEDANCE_ADDR)),
                  atximpedance);
  }

  return 0;
}

/*
 * Program dfimode:
 * - Dependencies:
 *   - user_input_basic.dramtype
 *   - user_input_basic.dfi1exists
 *   - user_input_basic.numactivedbytedfi0
 *   - user_input_basic.numactivedbytedfi1
 */
static void dfimode_program(void)
{
  uint16_t dfimode;

  if (userinputbasic.dfi1exists == 1)
  {
#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
    dfimode = 0x5U; /* DFI1 exists but disabled; DFI0 controls entire PHY */
#elif STM32MP_LPDDR4_TYPE
    if (userinputbasic.numactivedbytedfi1 > 0)
    {
      dfimode = 0x3U; /* Both DFI0 and DFI1 active */
    }
    else if ((userinputbasic.numactivedbytedfi0 > (userinputbasic.numdbyte / 2)) &&
             (userinputbasic.numdbyte == 4))
    {
      dfimode = 0x5U; /* DFI1 exists but disabled; DFI0 controls entire PHY */
    }
    else
    {
      dfimode = 0x1U; /* DFI1 exists but disabled; DFI0 controls 1/2 PHY */
    }
#endif /* STM32MP_LPDDR4_TYPE */
  }
  else
  {
    dfimode = 0x1U; /* DFI1 does not physically exists */
  }

#if STM32MP_LPDDR4_TYPE
  dfimode = 0x5U;
#endif /* STM32MP_LPDDR4_TYPE */

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TMASTER | CSR_DFIMODE_ADDR)), dfimode);
}

/*
 * Program dficamode:
 * - Fields:
 *   - DfiLp3CAMode
 *   - DfiD4CAMode
 *   - DfiLp4CAMode
 *   - DfiD4AltCAMode
 * - Dependencies:
 *   - user_input_basic.dramtype
 */
static void dficamode_program(void)
{
  uint16_t dficamode;

#if STM32MP_DDR3_TYPE
  dficamode = 0U;
#elif STM32MP_DDR4_TYPE
  dficamode = 2U;
#elif STM32MP_LPDDR4_TYPE
  dficamode = 4U;
#endif /* STM32MP_LPDDR4_TYPE */

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TMASTER | CSR_DFICAMODE_ADDR)), dficamode);
}

/*
 * Program caldrvstr0:
 * - Fields:
 *   - caldrvstrpd50[3:0]
 *   - caldrvstrpu50[7:4]
 * - Dependencies:
 *   - user_input_advanced.extcalresval
 *   - userinputadvanced.lp4lowpowerdrv (LPDDR4)
 *   - mb_ddr_1d[0].mr3_a0 (LPDDR4)
 */
static void caldrvstr0_program(void)
{
  uint16_t caldrvstr0;
  uint16_t caldrvstrpd50;
  uint16_t caldrvstrpu50;

  caldrvstrpu50 = (uint16_t)userinputadvanced.extcalresval;

  caldrvstrpd50 = caldrvstrpu50;
  caldrvstr0 = (caldrvstrpu50 << CSR_CALDRVSTRPU50_LSB) | caldrvstrpd50;

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TMASTER | CSR_CALDRVSTR0_ADDR)), caldrvstr0);
}

/*
 * Program CalUclkInfo:
 * - Impedance calibration CLK Counter.
 * - Fields:
 *   - caluclkticksper1us
 * - Dependencies:
 *   - user_input_basic.frequency
 */
static void caluclkinfo_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t p_addr;
    int64_t caluclkticksper1us_x10;
    uint16_t caluclkticksper1us;

    p_addr = pstate << 20;

    /* Number of DfiClk cycles per 1us */
    caluclkticksper1us_x10 = (int64_t)(10 * 1 * userinputbasic.frequency[pstate]) / 2;
    caluclkticksper1us = (uint16_t)(caluclkticksper1us_x10 / 10);

    if (((int64_t)(userinputbasic.frequency[pstate]) % 2) != 0)
    {
      caluclkticksper1us++;
    }

