STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_c_initphyconfig.c
    if (caluclkticksper1us < 24U)
    {
      /* Minimum value of caluclkticksper1us = 24 */
      caluclkticksper1us = 24U;
    }

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_CALUCLKINFO_ADDR)),
                  caluclkticksper1us);
  }
}

/*
 * Program Calibration CSRs based on user input
 *
 * CSRs to program:
 *      calrate: calinterval
 *               calonce
 * User input dependencies:
 *      calinterval
 *      calonce
 */
static void calibration_program(void)
{
  int32_t calinterval;
  int32_t calonce;
  uint16_t calrate;

  calinterval = userinputadvanced.calinterval;
  calonce = userinputadvanced.calonce;

  calrate = (uint16_t)((calonce << CSR_CALONCE_LSB) | (calinterval << CSR_CALINTERVAL_LSB));

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TMASTER | CSR_CALRATE_ADDR)), calrate);
}

/*
 * Program vrefinglobal:
 * - dqdqsrcvcntrl and csrvrefinglobal to select Global VREF
 *   from Master to be used in each DQ
 * - Fields:
 *   - globalvrefinsel: Select Range of GlobalVref DAC. Default: set to 1.
 *   - globalvrefindac: Vref level is set based on mb_ddr_1d[pstate].phyvref value.
 *     The following formula is used to convert the phyvref into the register setting.
 *       \f{eqnarray*}{
 *           PhyVrefPrcnt &=& \frac{mb_ddr_1d[pstate].phyvref}{128} \\
 *        if globalvrefinsel = 1 :
 *           globalvrefindac &=& 1+\frac{PhyVrefPrcnt}{0.005} \\
 *        if globalvrefinsel = 0 :
 *           globalvrefindac &=& \frac{(PhyVrefPrcnt-0.345)}{0.005} \\
 *           RxVref &=& (globalvrefindac == 0) ? Hi-Z : (PhyVrefPrcnt \times VDDQ)
 *        \f}
 * - Dependencies:
 *   - user_input_basic.dramtype
 *
 * Program dqdqsrcvcntrl:
 * - dqdqsrcvcntrl and csrvrefinglobal to select Global VREF
 *   from Master to be used in each DQ
 * - Fields:
 *  - selanalogvref
 *  - majormodedbyte
 *  - ExtVrefRange
 *  - DfeCtrl
 *  - GainCurrAdj
 * - Dependencies:
 *   - user_input_basic.dramtype
 */
static void vrefinglobal_program(void)
{
  int32_t majormodedbyte;
  int32_t pstate;

#if STM32MP_DDR3_TYPE
  majormodedbyte = 0;
#elif STM32MP_DDR4_TYPE
  majormodedbyte = 3;
#elif STM32MP_LPDDR4_TYPE
  majormodedbyte = 2;
#endif /* STM32MP_LPDDR4_TYPE */

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t vref_percentvddq;
    uint8_t globalvrefindac = 0x0U;
    uint8_t globalvrefinsel = 0x4U;
    int32_t byte;
    int32_t dfectrl_defval = 0;
    int32_t extvrefrange_defval = 0;
    int32_t gaincurradj_defval = 0xb;
    int32_t p_addr;
    int32_t selanalogvref = 1; /* Use Global VREF from Master */
    uint16_t dqdqsrcvcntrl;
    uint16_t vrefinglobal;

    vref_percentvddq = ((int32_t)(mb_ddr_1d[pstate].phyvref) * 1000 * 100) / 128;

    p_addr = pstate << 20;

    /* Check range1 first. Only use range0 if customer input maxes out range1. */
    globalvrefindac = (uint8_t)((vref_percentvddq / 500) + 1); /* Min value is 1 */
    if (globalvrefindac > 127U)
    {
      /* Min value is 1 */
      globalvrefindac = (uint8_t)(MAX((vref_percentvddq - 34500), 500) / 500);
      globalvrefinsel = 0x0U;
    }
    globalvrefindac = MIN(globalvrefindac, (uint8_t)127);

    vrefinglobal = (uint16_t)((globalvrefindac << CSR_GLOBALVREFINDAC_LSB) |
                               globalvrefinsel);
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_VREFINGLOBAL_ADDR)),
                  vrefinglobal);

    dqdqsrcvcntrl = (uint16_t)((gaincurradj_defval << CSR_GAINCURRADJ_LSB) |
                               (majormodedbyte << CSR_MAJORMODEDBYTE_LSB) |
                               (dfectrl_defval << CSR_DFECTRL_LSB) |
                               (extvrefrange_defval << CSR_EXTVREFRANGE_LSB) |
                               (selanalogvref << CSR_SELANALOGVREF_LSB));

    for (byte = 0; byte < userinputbasic.numdbyte; byte++)
    {
      int32_t c_addr;
      int32_t lane;

      c_addr = byte << 12;
      for (lane = 0; lane <= B_MAX; lane++)
      {
        int32_t b_addr;

        b_addr = lane << 8;
        mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TDBYTE | c_addr | b_addr |
                                                      CSR_DQDQSRCVCNTRL_ADDR)),
                      dqdqsrcvcntrl);
      }
    }
  }
}

/*
 * Program dfifreqratio :
 * - Dependencies:
 *   - user_input_basic.dfifreqratio
 */
static void dfifreqratio_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t p_addr;
    uint16_t dfifreqratio;

    p_addr = pstate << 20;

    dfifreqratio = (uint16_t)userinputbasic.dfifreqratio[pstate];

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_DFIFREQRATIO_ADDR)),
                  dfifreqratio);
  }
}

/*
 * Program tristatemodeca based on dramtype and 2T Timing
 * - Fields:
 *   - CkDisVal
 *   - disdynadrtri
 *   - ddr2tmode
 * - Dependencies:
 *   - user_input_basic.dramtype
 *   - user_input_advanced.is2ttiming
 *   - user_input_advanced.disdynadrtri
 */
static void tristatemodeca_program(void)
{
  int32_t ckdisval_def;
  int32_t pstate;

  /* CkDisVal depends on dramtype */
#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
  ckdisval_def = 1; /* {CLK_t,CLK_c} = 2'b00; */
#elif STM32MP_LPDDR4_TYPE
  ckdisval_def = 0; /* {CLK_t,CLK_c} = 2'b01; */
#endif /* STM32MP_LPDDR4_TYPE */

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t ddr2tmode;
    int32_t disdynadrtri;
    int32_t p_addr;
    uint16_t tristatemodeca;

    p_addr = pstate << 20;

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
    disdynadrtri = userinputadvanced.disdynadrtri[pstate];
#elif STM32MP_LPDDR4_TYPE
    disdynadrtri = 1;
#endif /* STM32MP_LPDDR4_TYPE */

    ddr2tmode = userinputadvanced.is2ttiming[pstate];

    tristatemodeca = (uint16_t)((ckdisval_def << CSR_CKDISVAL_LSB) |
                                (ddr2tmode << CSR_DDR2TMODE_LSB) |
                                (disdynadrtri << CSR_DISDYNADRTRI_LSB));

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_TRISTATEMODECA_ADDR)),
                  tristatemodeca);
  }
}

