STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_c_initphyconfig.c
/*
 * Program DfiXlat based on Pll Bypass Input
 * - Dependencies:
 *   - user_input_basic.dramtype
 *   - user_input_basic.pllbypass
 */
static void dfixlat_program(void)
{
  int32_t pstate;
  uint16_t loopvector;
  uint16_t pllbypass_dat = 0U;
  uint16_t skipddc_dat = 0U;  /*
           * Set to vector offset based on pstate frequency to disable
           * dram drift compensation.
           */

  for (pstate = 0; pstate < NB_PS; pstate++)
  {
    pllbypass_dat |= (uint16_t)(userinputbasic.pllbypass[pstate] << (4 * pstate));

    if (userinputbasic.frequency[pstate] < 333)
    {
      skipddc_dat |= 0x5U << (4 * pstate);
    }
  }

  for (loopvector = 0U; loopvector < 8U; loopvector++)
  {
    uint16_t dfifreqxlat_dat;
    uintptr_t reg = (uintptr_t)(DDRPHYC_BASE + 4 * (C0 | TMASTER | (CSR_DFIFREQXLAT0_ADDR +
                                                                    loopvector)));

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
    if (loopvector == 0U)
    {
      /*
       * Relock DfiFreq = 00,01,02,03)  Use StartVec 5 (pll_enabled) or
       * StartVec 6 (pll_bypassed).
       */
      dfifreqxlat_dat = pllbypass_dat + 0x5555U;

      mmio_write_16(reg, dfifreqxlat_dat);
    }
    else if (loopvector == 7U)
    {
      /* LP3-entry DfiFreq = 1F */
      mmio_write_16(reg, 0xF000U);
    }
    else
    {
      /*
       * Everything else = skip retrain  (could also map to 0000 since retrain
       * code is excluded, but this is cleaner).
       */
      mmio_write_16(reg, 0x5555U);
    }
#elif STM32MP_LPDDR4_TYPE
    if (loopvector == 0U)
    {
      /*
       * Retrain & Relock DfiFreq = 00,01,02,03)  Use StartVec 0 (pll_enabled) or
       * StartVec 1 (pll_bypassed).
       */
      dfifreqxlat_dat = pllbypass_dat + skipddc_dat + 0x0000U;
      mmio_write_16(reg, dfifreqxlat_dat);
    }
    else if (loopvector == 2U)
    {
      /*
       * Retrain only DfiFreq = 08,09,0A,0B)  Use StartVec 4 (1, and maybe 2,3,
       * used by verif).
       */
      mmio_write_16(reg, 0x4444U);
    }
    else if (loopvector == 3U)
    {
      /* Phymstr type state change, StartVec 8 */
      mmio_write_16(reg, 0x8888U);
    }
    else if (loopvector == 4U)
    {
      /*
       * Relock only DfiFreq = 10,11,12,13   Use StartVec 5 (pll_enabled) or
       * StartVec 6 (pll_bypassed).
       */
      dfifreqxlat_dat = pllbypass_dat + 0x5555U;
      mmio_write_16(reg, dfifreqxlat_dat);
    }
    else if (loopvector == 7U)
    {
      /* LP3-entry DfiFreq = 1F */
      mmio_write_16(reg, 0xF000U);
    }
    else
    {
      /* Everything else */
      mmio_write_16(reg, 0x0000U);
    }
#endif /* STM32MP_LPDDR4_TYPE */
  }
}

/*
 * Program dqdqsrcvcntrl1 (Receiver Powerdown) and DbyteMiscMode
 * - see function ddrphy_phyinit_isdbytedisabled() to determine
 *   which DBytes are turned off completely based on PHY configuration.
 * - Fields:
 *   - DByteDisable
 *   - PowerDownRcvr
 *   - PowerDownRcvrDqs
 *   - RxPadStandbyEn
 * - Dependencies:
 *   - user_input_basic.dramtype
 *   - user_input_basic.dfi1exists
 *   - user_input_basic.numactivedbytedfi0
 *   - user_input_basic.numactivedbytedfi1
 *   - user_input_basic.numdbyte
 *   - user_input_basic.dramdatawidth (DDR3/DDR4)
 *   - mb_ddr_1d[0].mr5 (DDR4)
 *   - user_input_advanced.lp4dbird (LPDDR4)
 */
static void dqdqsrcvcntrl1_program(void)
{
  int32_t lp4dbird __unused;
  int32_t pstate __unused;
  int32_t index;
  uint16_t mr5 __unused;
  uint16_t regdata;
  uint16_t regdata1;
  uint16_t regdata2; /* Turn off Rx of DBI lane */

  regdata = 0x1U << CSR_DBYTEDISABLE_LSB;

  regdata1 = (0x1FFU << CSR_POWERDOWNRCVR_LSB |
              0x1U << CSR_POWERDOWNRCVRDQS_LSB |
              0x1U << CSR_RXPADSTANDBYEN_LSB);

  regdata2 = (0x100U << CSR_POWERDOWNRCVR_LSB | CSR_RXPADSTANDBYEN_MASK);

#if STM32MP_DDR4_TYPE
  mr5 = 0U;
#elif STM32MP_LPDDR4_TYPE
  lp4dbird = 0;
#endif /* STM32MP_LPDDR4_TYPE */

#if !STM32MP_DDR3_TYPE
  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
#if STM32MP_DDR4_TYPE
    /* OR all mr4 masked values, to help check in next loop */
    mr5 |= (mb_ddr_1d[pstate].mr5 >> 12) & 0x1U;
#elif STM32MP_LPDDR4_TYPE
    /* OR all Lp4DbiRd values, to help check in next loop */
    lp4dbird |= userinputadvanced.lp4dbird[pstate];
#endif /* STM32MP_LPDDR4_TYPE */
  }
#endif /* !STM32MP_DDR3_TYPE */

  /* Implements Section 1.3 of Pub Databook */
  for (index = 0; index < userinputbasic.numdbyte; index++)
  {
    /* For each dbyte */
    int32_t c_addr;

    c_addr = index * C1;
    if (ddrphy_phyinit_isdbytedisabled(index))
    {
      mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (c_addr | TDBYTE | CSR_DBYTEMISCMODE_ADDR)),
                    regdata);
      mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (c_addr | TDBYTE | CSR_DQDQSRCVCNTRL1_ADDR)),
                    regdata1);
    }
    else
    {
      /* Disable RDBI lane if not used. */
#if STM32MP_DDR3_TYPE
      if ((userinputbasic.dramdatawidth != 4))
#elif STM32MP_DDR4_TYPE
      if ((userinputbasic.dramdatawidth != 4) && (mr5 == 0U))
#elif STM32MP_LPDDR4_TYPE
      if (lp4dbird == 0)
#endif /* STM32MP_LPDDR4_TYPE */
      {
        mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (c_addr | TDBYTE | CSR_DQDQSRCVCNTRL1_ADDR)),
                      regdata2);
      } /* DBI */
    } /* DbyteDisable */
  } /* for each dbyte */
}

/*
 * Program masterx4config
 * - Fields:
 *   - x4tg
 *   - masterx4config
 * - Dependencies:
 *   - user_input_basic.dramdatawidth
 *
 * \note PHY does not support mixed dram device data width
 */
static void masterx4config_program(void)
{
  int32_t x4tg;
  uint16_t masterx4config;

  if (userinputbasic.dramdatawidth == 4)
  {
    x4tg = 0xF;
  }
  else
  {
    x4tg = 0x0;
  }

  masterx4config = (uint16_t)(x4tg << CSR_X4TG_LSB);

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TMASTER | CSR_MASTERX4CONFIG_ADDR)),
                masterx4config);
}

#if !STM32MP_DDR3_TYPE
/*
 * Program dmipinpresent based on dramtype and Read-DBI enable
 * - Fields:
 *   - RdDbiEnabled
 * - Dependencies:
 *   - user_input_basic.dramdatawidth
 *   - mb_ddr_1d[0].mr5 (DDR4)
 *   - user_input_advanced.lp4dbird (LPDDR4)
 */
static void dmipinpresent_program(void)
{
  int32_t pstate;

  for (pstate = 0; pstate < userinputbasic.numpstates; pstate++)
  {
    int32_t p_addr;
    uint16_t dmipinpresent;

    p_addr = pstate << 20;

#if STM32MP_DDR4_TYPE
    /* For DDR4, Read DBI is enabled in mr5-A12 */
    dmipinpresent = (mb_ddr_1d[pstate].mr5 >> 12) & 0x1U;
#elif STM32MP_LPDDR4_TYPE
    dmipinpresent = (uint16_t)userinputadvanced.lp4dbird[pstate];
#endif /* STM32MP_LPDDR4_TYPE */

    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (p_addr | TMASTER | CSR_DMIPINPRESENT_ADDR)),
                  dmipinpresent);
  }
}
#endif /* !STM32MP_DDR3_TYPE */

