STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr_ddrphy_phyinit_c_initphyconfig.c
/*
 * Program aforcetricont and acx4anibdis
 * - Fields:
 *   - aforcetricont
 *   - acx4anibdis
 * - Dependencies:
 *   - user_input_basic.numrank_dfi0
 *   - user_input_basic.numrank_dfi1
 *   - user_input_basic.numanib
 *   - user_input_advanced.disableunusedaddrlns
 */
static void aforcetricont_acx4anibdis_program(void)
{
  int32_t anib;
  uint16_t acx4anibdis = 0x0U;

  for (anib = 0;
       (anib < userinputbasic.numanib) && (userinputadvanced.disableunusedaddrlns != 0);
       anib++)
  {
    int32_t c_addr;
#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
    int32_t numrank = userinputbasic.numrank_dfi0 + userinputbasic.numrank_dfi1;
#elif STM32MP_LPDDR4_TYPE
    int32_t numrank0 = userinputbasic.numrank_dfi0;
    int32_t numrank1 = userinputbasic.numrank_dfi1;
#endif /* STM32MP_LPDDR4_TYPE */
    uint16_t aforcetricont = 0x0U;

    c_addr = anib << 12;

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
    if ((anib == 0) && (numrank == 1))
    {
      aforcetricont = 0x2U;
    }
    else if ((anib == 1) && (numrank == 1))
    {
      aforcetricont = 0xCU;
    }
    else if (anib == 6)
    {
      aforcetricont = 0x1U;
    }
#elif STM32MP_LPDDR4_TYPE
    if ((anib == 0) && (numrank0 == 0))
    {
      aforcetricont = 0xFU;
    }
    else if ((anib == 0) && (numrank0 == 1))
    {
      aforcetricont = 0x2U;
    }
    else if ((anib == 1) && (numrank0 == 0))
    {
      aforcetricont = 0xFU;
    }
    else if ((anib == 1) && (numrank0 == 1))
    {
      aforcetricont = 0x8U;
    }
    else if ((anib == 2) && (numrank0 == 0))
    {
      aforcetricont = 0xFU;
    }
    else if ((anib == 3) && (numrank1 == 0))
    {
      aforcetricont = 0xFU;
    }
    else if ((anib == 3) && (numrank1 == 1))
    {
      aforcetricont = 0x2U;
    }
    else if ((anib == 4) && (numrank1 == 0))
    {
      aforcetricont = 0xFU;
    }
    else if ((anib == 4) && (numrank1 == 1))
    {
      aforcetricont = 0x8U;
    }
    else if ((anib == 5) && (numrank1 == 0))
    {
      aforcetricont = 0xFU;
    }
    else if (anib == 6)
    {
      aforcetricont = 0xFU;
    }
    else if (anib == 7)
    {
      aforcetricont = 0xFU;
    }
#endif /* STM32MP_LPDDR4_TYPE */

    /*
     * If all the lanes can be disabled, and Anib is not the first or last disable
     * entire chiplet
     */
    if ((aforcetricont == 0xFU) && (anib != 0) && (anib != (userinputbasic.numanib - 1)))
    {
      acx4anibdis = acx4anibdis | (0x1U << anib);
    }
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TANIB | c_addr | CSR_AFORCETRICONT_ADDR)),
                  aforcetricont);
  }

  mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TMASTER | CSR_ACX4ANIBDIS_ADDR)),
                acx4anibdis);
}

/*
 * Implements Step C of initialization sequence
 *
 * This function programs majority of PHY configuration registers based
 * on data input into PhyInit data structures.
 *
 * This function programs PHY configuration registers based on information
 * provided in the PhyInit data structures (userinputbasic, userinputadvanced).
 * The user can overwrite the programming of this function by modifying
 * ddrphy_phyinit_usercustom_custompretrain().  Please see
 * ddrphy_phyinit_struct.h for PhyInit data structure definition.
 *
 * \return 0 on success.
 */
int32_t ddrphy_phyinit_c_initphyconfig(void)
{
  int32_t twotckrxdqspre[NB_PS] = { };
  int32_t ret;

  /*
   * Step (C) Initialize PHY Configuration
   * Load the required PHY configuration registers for the appropriate mode and memory
   * configuration.
   */

  VERBOSE("%s Start\n", __func__);

  txslewrate_program();

  atxslewrate_program();

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
  dfidatacsdestmap_program();
#endif /* STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE */

  pllctrl2_program();

  ardptrinitval_program();

#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
  procodtctl_program();
#endif /* STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE */

  dbytedllmodecntrl_program(twotckrxdqspre);

  procodttimectl_program(twotckrxdqspre);

  ret = txodtdrvstren_program();
  if (ret != 0)
  {
    return ret;
  }

  ret = tximpedancectrl1_program();
  if (ret != 0)
  {
    return ret;
  }

  ret = atximpedance_program();
  if (ret != 0)
  {
    return ret;
  }

  dfimode_program();

  dficamode_program();

  caldrvstr0_program();

  caluclkinfo_program();

  calibration_program();

  vrefinglobal_program();

  dfifreqratio_program();

  tristatemodeca_program();

  dfixlat_program();

  dqdqsrcvcntrl1_program();

  masterx4config_program();

#if !STM32MP_DDR3_TYPE
  dmipinpresent_program();

#if STM32MP_LPDDR4_TYPE
  /*
   * Program DFIPHYUPD
   * - Fields:
   *   - DFIPHYUPDMODE
   *   - DFIPHYUPDCNT
   * - Dependencies:
   *   - user_input_advanced.disablephyupdate
   */
  if (userinputadvanced.disablephyupdate != 0)
  {
    mmio_write_16((uintptr_t)(DDRPHYC_BASE + 4 * (TMASTER | CSR_DFIPHYUPD_ADDR)), 0x0U);
  }
#endif /* STM32MP_LPDDR4_TYPE */
#endif /* !STM32MP_DDR3_TYPE */

  aforcetricont_acx4anibdis_program();

  VERBOSE("%s End\n", __func__);

  return 0;
}
